package HomeworkAQAjava;

import java.util.Scanner;

public class HomeWork3 {
    public static void main(String[] args) {
        /*TASK 1*/
        /*У вас есть строка "Я тестирую замечательно. Что еще нужно?", которую нужно ввести с клавиатуры в консоль.
Необходимо при помощи только  метода next() класса Scanner (не используем метод nextLine()) присвоить перемнным типа String следующие значения:
string1 = Я
string2 = тестирую
string3 = замечательно
string4 = Что еще нужно?
Помимо string1, string2, string3, string4 новых переменных
создавать нельзя.*/

        System.out.println("=========================================================================================");

        /*TASK 2*/
        /*Пользователь вводит с клавиатуры три целочисленных значения. На экран выводится информация можно ли из этих сторон
построить треугольник. (необходимо вспомнить правило построения треугольника по трем сторонам).*/









    }
}
